src/Catalogs/ТипыНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>ТипыНоменклатуры</Name>
			<Comment>Основной признак номенклатурной позиции</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидНоменклатуры</Name>
					<Comment>Вид номенклатуры</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Весовой</Name>
					<Comment>Признак указывает, что товар является весовым. Используется для определения вида штрих-кодирования</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользованиеХарактеристик</Name>
					<Comment>Способ использования характеристик</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользованиеШтрихКодов</Name>
					<Comment>Использование штрихкодов</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БазоваяЕдиницаИзмерения</Name>
					<Comment>Основная единица измерения, подставляемая по умолчанию для номенклатурных позиций данного типа</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвтоСписаниеХарактеристик</Name>
					<Comment>Режим автоматического списания характеристик номенклатуры</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.РежимыАвтоСписанияХарактеристик</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОграничениеДанныхХарактеристик</Name>
					<Comment>Ограничение данных характеристик</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ОграниченияДанныхХарактеристики</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УникальностьСерийногоНомера</Name>
					<Comment>Уникальность серийного номера</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойТипЭксплуатации</Name>
					<Comment>Основной тип эксплуатации</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыЭксплуатации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШтучноВесовой</Name>
					<Comment>Признак штучно-весового товара. Используется для определения вида штрих-кодирования</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчетЦенТолькоВРазрезеДопПараметров</Name>
					<Comment>Задает ограничение на поиск цены для данного типа номенклатуры. Если Истина - то поиск цены будет осуществляться только в разрезе доп. параметров (характеристики, единицы измерения, подразделения)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаборСвойствНоменклатуры</Name>
					<Comment>Набор свойств</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.НаборыДополнительныхРеквизитовИСведений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаборСвойствХарактеристик</Name>
					<Comment>Набор свойств</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.НаборыДополнительныхРеквизитовИСведений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонЦенника</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ШаблоныЭтикетокИЦенников</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонЭтикетки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ШаблоныЭтикетокИЦенников</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПризнакПредметаРасчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПризнакиПредметаРасчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользованиеЕдиницИзмерения</Name>
					<Comment>Способ использования единиц измерения</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонНаименованийТоваров</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсобенностьУчета</Name>
					<Comment>Особенность учета</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ОсобенностиУчетаНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛокНаименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеИностранное</Name>
					<Comment>Иностранное наименование</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/CommonForms/ФормаРедактированияШаблонаНаименования/Ext/Form/Module.bsl
#Область РазделОбъявленияПеременных

&НаКлиенте
Перем СтарыйШаблон;     //Шаблон, заполняемый из параметра при открытии формы, т.е. до редактирования
#КонецОбласти


#Область ОбработчикиСобытийКомандФормы

&НаКлиенте
Процедура Подключаемый_КомандаВставитьПараметр(Команда)
	
	ПараметрИдентификатор = ПараметрИдентификатор(Команда.Имя);
	
	ВыбраннаяСтрока = ТаблицаДоступныхПолей[ПараметрИдентификатор];
	
	ДобавитьСтрокуВТаблицуВыбранных(ВыбраннаяСтрока);
	СформироватьШаблон();
		
КонецПроцедуры

&НаКлиенте
Функция ПараметрИдентификатор(КомандаИмя)
	
	Возврат Число(СтрЗаменить(КомандаИмя, "КомандаВставитьПараметр", ""));
	
КонецФункции

&НаКлиенте
Процедура ДобавитьБлокВШаблон(БлокТекст = Неопределено, ПараметрИдентификатор = Неопределено)
	
	//Если ПараметрИдентификатор <> Неопределено Тогда
	//	Параметр = ТаблицаДоступныхПолей[ПараметрИдентификатор].Префикс;
	//Иначе
	//	Параметр = "";
	//КонецЕсли;
	//
	//Если БлокТекст <> Неопределено Тогда
	//	Текст = "" + БлокТекст + " ";
	//	ПредопределенныйРазделитель = "";
	//ИначеЕсли ПараметрИдентификатор <> Неопределено Тогда
	//	Текст = "" + Реквизиты[ПараметрИдентификатор].Заголовок;
	//	Если ЗначениеЗаполнено(Текст) Тогда
	//		Текст = Текст + " ";
	//	КонецЕсли;
	//	Если ЗначениеЗаполнено(Объект.ШаблонДляПредставления) Тогда
	//		ПредопределенныйРазделитель = ", ";
	//	Иначе
	//		ПредопределенныйРазделитель = "";
	//	КонецЕсли;
	//Иначе
	//	Текст = "";
	//	ПредопределенныйРазделитель = ", ";
	//КонецЕсли;
	//
	//ТекстДляВставки = "{%1%2%3}";
	//ТекстДляВставки = СтрШаблон(ТекстДляВставки, ПредопределенныйРазделитель, Текст, Параметр);
	//
	//СтрокаНач = 0;
	//СтрокаКон = 0;
	//КолонкаНач = 0;
	//КолонкаКон = 0;
	//Элементы.ШаблонДляПредставления.ПолучитьГраницыВыделения(СтрокаНач, КолонкаНач, СтрокаКон, КолонкаКон);
	//
	//ПозицияНачалаВставки = ОпределитьПозициюВставкиТекста(СтрокаНач, КолонкаНач, СтрокаКон, КолонкаКон);
	//ПозицияКонцаВставки = ПозицияНачалаВставки + СтрДлина(ТекстДляВставки);
	//
	//ПозицияКурсора.НачалоСтроки = СтрокаНач;
	//ПозицияКурсора.НачалоКолонки = ПозицияКонцаВставки;
	//ПозицияКурсора.КонецСтроки = СтрокаКон;
	//ПозицияКурсора.КонецКолонки = ПозицияКонцаВставки;
	//
	//Текст = Объект.ШаблонДляПредставления;
	//
	//Если НЕ ЗначениеЗаполнено(Текст) Тогда
	//	Объект.ШаблонДляПредставления = ТекстДляВставки;
	//Иначе
	//	Объект.ШаблонДляПредставления = Лев(Текст, ПозицияНачалаВставки - 1) + ТекстДляВставки + Прав(Текст, СтрДлина(Текст) - ПозицияНачалаВставки + 1);
	//КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаСервере
Процедура СоздатьКомандыДобавленияПараметров()
	
	Для Итератор = 0 По ТаблицаДоступныхПолей.Количество() - 1 Цикл
		
		Реквизит = ТаблицаДоступныхПолей[Итератор];
		
		НоваяКоманда = Команды.Добавить("КомандаВставитьПараметр" + Итератор);
		НоваяКоманда.Действие = "Подключаемый_КомандаВставитьПараметр";
		НоваяКоманда.Заголовок = Реквизит.Расшифровка;
		
		НоваяКнопка = Элементы.Добавить("КомандаВставитьПараметр" + Итератор, Тип("КнопкаФормы"), Элементы.ГруппаДобавитьПараметр);
		НоваяКнопка.ИмяКоманды = "КомандаВставитьПараметр" + Итератор;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДоступныеПоля()
	
	НоваяСтрока = ТаблицаДоступныхПолей.Добавить();
	НоваяСтрока.Префикс = "#тк#";
	НоваяСтрока.Расшифровка = "Товарная категория";

	НоваяСтрока = ТаблицаДоступныхПолей.Добавить();
	НоваяСтрока.Префикс = "#тм#";
	НоваяСтрока.Расшифровка = "Товарная марка";
	
	НоваяСтрока = ТаблицаДоступныхПолей.Добавить();
	НоваяСтрока.Префикс = "#за#";
	НоваяСтрока.Расшифровка = "Значение ассортимента";
	
	//НоваяСтрока = ТаблицаДоступныхПолей.Добавить();
	//НоваяСтрока.Префикс = "#ум#";
	//НоваяСтрока.Расшифровка = "Уточнение товарной марки";
	
	НоваяСтрока = ТаблицаДоступныхПолей.Добавить();
	НоваяСтрока.Префикс = "#пр#";
	НоваяСтрока.Расшифровка = "Производитель";
	
	НоваяСтрока = ТаблицаДоступныхПолей.Добавить();
	НоваяСтрока.Префикс = "#сп#";
	НоваяСтрока.Расшифровка = "Страна происхождения";
	
	НоваяСтрока = ТаблицаДоступныхПолей.Добавить();
	НоваяСтрока.Префикс = "#ОБ#";
	НоваяСтрока.Расшифровка = "Объем";
	
	Если ТипЗнч(ОбъектШаблона) = Тип("СправочникСсылка.ТипыНоменклатуры") Тогда 
		НаборСвойствНоменклатуры = ОбъектШаблона.НаборСвойствНоменклатуры
	ИначеЕсли ТипЗнч(ОбъектШаблона) = Тип("СправочникСсылка.Номенклатура") Тогда 
		НаборСвойствНоменклатуры = ОбъектШаблона.ТипНоменклатуры.НаборСвойствНоменклатуры;
	Иначе
		НаборСвойствНоменклатуры = Справочники.НаборыДополнительныхРеквизитовИСведений.ПустаяСсылка();
	КонецЕсли;
	
	ДопРеквизиты = Справочники.Номенклатура.ПолучитьДопРеквизитыИСведенийОбъекта(НаборСвойствНоменклатуры);
	
	// НОВЫЙ вариант - в наименовании могут содержаться только реквизиты
	Для Каждого ТекущийДопРеквизит Из ДопРеквизиты Цикл
		Если ТекущийДопРеквизит.ЭтоРеквизит Тогда
			НоваяСтрока = ТаблицаДоступныхПолей.Добавить();
			НоваяСтрока.Префикс = "#др#";
			НоваяСтрока.Расшифровка = ТекущийДопРеквизит.ИмяПоля + " (доп. рекв.)";
			НоваяСтрока.РеквизитСведение = ТекущийДопРеквизит.Свойство;
			НоваяСтрока.ИмяПоля          = ТекущийДопРеквизит.ИмяПоля;
		Иначе
			НоваяСтрока = ТаблицаДоступныхПолей.Добавить();
			НоваяСтрока.Префикс = "#дс#";
			НоваяСтрока.Расшифровка = ТекущийДопРеквизит.ИмяПоля + " (доп. св-во)";
			НоваяСтрока.РеквизитСведение =ТекущийДопРеквизит.Свойство;
			НоваяСтрока.ИмяПоля          = ТекущийДопРеквизит.ИмяПоля;
		КонецЕсли;
	КонецЦикла;
	
	НоваяСтрока = ТаблицаДоступныхПолей.Добавить();
	НоваяСтрока.Префикс = "#*др#";
	НоваяСтрока.Расшифровка = "Все дополнительные реквизиты товара";
	
	НоваяСтрока = ТаблицаДоступныхПолей.Добавить();
	НоваяСтрока.Префикс = "#пт#";
	НоваяСтрока.Расшифровка = "Произвольный текст";

	
	СоздатьКомандыДобавленияПараметров();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоляИзШаблона()

	ТаблицаЭлементов = Справочники.ТипыНоменклатуры.ПолучитьТаблицуЭлементовШаблона(Шаблон);
	
	Для Каждого СтрокаЭлемента Из ТаблицаЭлементов Цикл
		НоваяСтрока = ТаблицаВыбранныхПолей.Добавить();
		НоваяСтрока.Префикс =  СтрокаЭлемента.Префикс;
		НоваяСтрока.Расшифровка = СтрокаЭлемента.Расшифровка;
		НоваяСтрока.Значение = СтрокаЭлемента.Значение;
		НоваяСтрока.ИмяПоля = СтрокаЭлемента.Значение;
		НоваяСтрока.Подпись = СтрокаЭлемента.Подпись;
		НоваяСтрока.Заглавными = СтрокаЭлемента.Заглавными;
		Если ЗначениеЗаполнено(СтрокаЭлемента.Значение) Тогда 
			НаименованиеВыбранногоРеквизитаСведения = "<" + СтрокаЭлемента.Значение + ">";
		Иначе 
			НаименованиеВыбранногоРеквизитаСведения = "";
		КонецЕсли;
		НоваяСтрока.Описание = СтрокаЭлемента.Префикс + " " + СтрокаЭлемента.Расшифровка + " " + НаименованиеВыбранногоРеквизитаСведения;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Функция УстановитьОписаниеТекущегоПоля(ТекущаяСтрока)
	Если ЗначениеЗаполнено(ТекущаяСтрока.Значение) Тогда 
		НаименованиеВыбранногоРеквизитаСведения = "<" + ТекущаяСтрока.ИмяПоля + ">";
	Иначе 
		НаименованиеВыбранногоРеквизитаСведения = "";
	КонецЕсли;

	ТекущаяСтрока.Описание = ТекущаяСтрока.Префикс + " " + ТекущаяСтрока.Расшифровка + " " + НаименованиеВыбранногоРеквизитаСведения;
	
КонецФункции

&НаСервере
Процедура СформироватьШаблонНаСервере()
	
	ШаблонСтрока = "";
	Для Каждого ВыбСтрока Из ТаблицаВыбранныхПолей Цикл
		
		Если (ВРег(ВыбСтрока.Префикс) = "#ПТ#") Тогда
			Если Не ЗначениеЗаполнено(ВыбСтрока.Значение) Тогда   // пропускаем текстовые поля без собственно текста
				Продолжить;
			КонецЕсли;
			ШаблонСтрока = ШаблонСтрока + ВыбСтрока.Префикс + ?(СокрЛП(ВыбСтрока.Значение) = "", "", "<" + СокрЛП(ВыбСтрока.Значение) + ">") + " ";
		Иначе	
			ШаблонСтрока = ШаблонСтрока + ВыбСтрока.Префикс + ?(СокрЛП(ВыбСтрока.ИмяПоля) = "", "", "<" + ВыбСтрока.ИмяПоля + ">")+?(СокрЛП(ВыбСтрока.Подпись) = "", "", СокрЛП(ВыбСтрока.Подпись)) + " ";
		КонецЕсли;	
		
	КонецЦикла;	 
	Шаблон = СокрЛП(ШаблонСтрока);
	НаименованиеТовара = СформироватьНаименованиеТовараПоШаблону(Шаблон, ОбъектШаблона);
			
КонецПроцедуры	


&НаКлиенте
Процедура СформироватьШаблон()
	
	СформироватьШаблонНаСервере();
	
	Модифицированность = (СтарыйШаблон <> Шаблон);
	
КонецПроцедуры	


&НаКлиенте
Процедура ДобавитьСтрокуВТаблицуВыбранных(ВыбраннаяСтрока)
	
	Если ЗначениеЗаполнено(ВыбраннаяСтрока.РеквизитСведение) Тогда
		НаименованиеРеквизитаСведения = Строка(ВыбраннаяСтрока.РеквизитСведение);
	Иначе 
		НаименованиеРеквизитаСведения = "";
	КонецЕсли;
	
	Если ТаблицаВыбранныхПолей.НайтиСтроки(Новый Структура("Префикс, Значение", ВыбраннаяСтрока.Префикс, НаименованиеРеквизитаСведения)).Количество() +
		ТаблицаВыбранныхПолей.НайтиСтроки(Новый Структура("Префикс, Значение", ВРег(ВыбраннаяСтрока.Префикс), НаименованиеРеквизитаСведения)).Количество() = 0 Тогда 
		НоваяСтрока = ТаблицаВыбранныхПолей.Добавить();
		НоваяСтрока.Префикс     =  ВыбраннаяСтрока.Префикс;
		НоваяСтрока.Расшифровка = ВыбраннаяСтрока.Расшифровка;
		НоваяСтрока.ИмяПоля     = ВыбраннаяСтрока.ИмяПоля;
		НоваяСтрока.Значение    = НаименованиеРеквизитаСведения;
		УстановитьОписаниеТекущегоПоля(НоваяСтрока);
		
		Если  ВРег(ВыбраннаяСтрока.Префикс) = "#ПТ#" Тогда
			Элементы.ТаблицаВыбранныхПолей.ТекущаяСтрока = НоваяСтрока.ПолучитьИдентификатор(); 
			Элементы.ТаблицаВыбранныхПолей.ТекущийЭлемент = Элементы.ТаблицаВыбранныхПолейЗначение;			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры	

&НаСервере
Функция СформироватьНаименованиеТовараПоШаблону(ШаблонНаименования, ТекущийОбъект)
	Возврат Справочники.Номенклатура.СформироватьНаименованиеТовараПоШаблону(ШаблонНаименования, ТекущийОбъект);
КонецФункции	

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ



&НаКлиенте
Процедура ТаблицаВыбранныхПолейПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
		
	Отказ = Истина;
		
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаВыбранныхПолейПриИзменении(Элемент)
	
	СформироватьШаблон();
	Модифицированность = ИСТИНА;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаВыбранныхПолейПриАктивизацииСтроки(Элемент)
	
	Если Элементы.ТаблицаВыбранныхПолей.ТекущиеДанные <> Неопределено Тогда 
		Элементы.ТаблицаВыбранныхПолейЗначение.ТолькоПросмотр =  (ВРег(Элементы.ТаблицаВыбранныхПолей.ТекущиеДанные.Префикс) <> "#ПТ#");
		
		Элементы.ТаблицаВыбранныхПолейПодпись.ТолькоПросмотр =  НЕ((ВРег(Элементы.ТаблицаВыбранныхПолей.ТекущиеДанные.Префикс) = "#ДР#") ИЛИ
																(ВРег(Элементы.ТаблицаВыбранныхПолей.ТекущиеДанные.Префикс) = "#ДС#"));
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаВыбранныхПолейЗаглавнымиПриИзменении(Элемент)
	
	Если Элементы.ТаблицаВыбранныхПолей.ТекущиеДанные.Заглавными = Истина Тогда 
		 Элементы.ТаблицаВыбранныхПолей.ТекущиеДанные.Префикс = ВРег(Элементы.ТаблицаВыбранныхПолей.ТекущиеДанные.Префикс);
	 Иначе
		 Элементы.ТаблицаВыбранныхПолей.ТекущиеДанные.Префикс = НРег(Элементы.ТаблицаВыбранныхПолей.ТекущиеДанные.Префикс);
	 КонецЕсли;	
	 УстановитьОписаниеТекущегоПоля(Элементы.ТаблицаВыбранныхПолей.ТекущиеДанные);

	 СформироватьШаблон();
	 
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаВыбранныхПолейЗначениеПриИзменении(Элемент)
	
	УстановитьОписаниеТекущегоПоля(Элементы.ТаблицаВыбранныхПолей.ТекущиеДанные);
	СформироватьШаблон();

КонецПроцедуры

&НаКлиенте
Процедура ВсеЗаглавными(Команда)
	Для Каждого СтрокаВыбранных Из ТаблицаВыбранныхПолей Цикл
		СтрокаВыбранных.Заглавными = Истина;
		СтрокаВыбранных.Префикс = ВРег(СтрокаВыбранных.Префикс);
		УстановитьОписаниеТекущегоПоля(СтрокаВыбранных);
	КонецЦикла;
	СформироватьШаблон();
КонецПроцедуры

&НаКлиенте
Процедура ВсеСтрочными(Команда)
	Для Каждого СтрокаВыбранных Из ТаблицаВыбранныхПолей Цикл
		СтрокаВыбранных.Заглавными = Ложь;
		СтрокаВыбранных.Префикс = НРег(СтрокаВыбранных.Префикс);
		УстановитьОписаниеТекущегоПоля(СтрокаВыбранных);
	КонецЦикла;
	СформироватьШаблон();
КонецПроцедуры

&НаКлиенте
Процедура ЗакончитьРедактирование(Команда) 
	
	Модифицированность = ЛОЖЬ; //сбросим флаг модифицированности, чтобы при закрытии не задавался вопрос о сохранении изменений
	СтруктураРезультата = Новый Структура("Шаблон", Шаблон);
	Закрыть(СтруктураРезультата);
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьВсе(Команда)
	
	Для Каждого СтрокаДоступных Из ТаблицаДоступныхПолей Цикл
		ДобавитьСтрокуВТаблицуВыбранных(СтрокаДоступных);
		
	КонецЦикла;
	СформироватьШаблон();
	
КонецПроцедуры

&НаКлиенте
Процедура ШаблонИзменениеТекстаРедактирования(Элемент, Текст, СтандартнаяОбработка)
	
	
	
КонецПроцедуры

// Обработчик результата оповещения команд заполнить и очистить смещение.
//
// Параметры:
//  РезультатОповещения     - Произвольный - Результат выполнения операции в подчиненной форме.
//  ДополнительныеПараметры - Произвольный - Значение, которое было указано при создании объекта описания оповещения.
//
&НаКлиенте
Процедура ОбработкаРезультатаОповещенияОчиститьТаблицу(РезультатОповещения, ДополнительныеПараметры=Неопределено) Экспорт
	
	Если РезультатОповещения = КодВозвратаДиалога.Да Тогда
			ТаблицаВыбранныхПолей.Очистить();
			СформироватьШаблон();
			Модифицированность = Истина;
	КонецЕсли;
		
КонецПроцедуры // ОбработкаРезультатаОповещенияКомандыСмещение()


&НаКлиенте
Процедура ТаблицаВыбранныхПолейОчистить(Команда)
	
	Если ТаблицаВыбранныхПолей.Количество()>0 Тогда
		
		// Формируем описание обработчика перехвата закрытия формы
		ОбработчикОчистить = Новый ОписаниеОповещения("ОбработкаРезультатаОповещенияОчиститьТаблицу", ЭтотОбъект);
		
		ПоказатьВопрос(ОбработчикОчистить,НСтр("ru = 'Очистить таблицу?'"),РежимДиалогаВопрос.ДаНет);
		
	КонецЕсли;

КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ ОСНОВНЫХ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("ОбъектШаблона", ОбъектШаблона);
	Параметры.Свойство("ТекущийШаблон", Шаблон);
	
	ЗаполнитьДоступныеПоля();
	ЗаполнитьПоляИзШаблона();
	
	СформироватьШаблонНаСервере();
	
КонецПроцедуры


&НаКлиенте
Процедура ПередЗакрытиемЗавершение(Ответ = Неопределено, ДополнительныеПараметры = Неопределено) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		
		Модифицированность = ЛОЖЬ;
		СтруктураРезультата = Новый Структура("Шаблон", Шаблон);
		Закрыть(СтруктураРезультата)
		
	ИначеЕсли Ответ = КодВозвратаДиалога.Нет Тогда
		
		Модифицированность = ЛОЖЬ;
		Закрыть();
		 
	КонецЕсли;
	
		
КонецПроцедуры 


&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если Не Модифицированность Тогда
		Возврат;
	КонецЕсли;
			
	Отказ = Истина; 
	Если ЗавершениеРаботы Тогда
		Возврат;
	КонецЕсли;
	
	ТекстВопроса = НСтр("ru = 'Данные были изменены. Сохранить изменения?'");
	ОписаниеОповещения = Новый ОписаниеОповещения("ПередЗакрытиемЗавершение", ЭтотОбъект);
	ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНетОтмена,, КодВозвратаДиалога.Да);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	СтарыйШаблон = Шаблон;
	
КонецПроцедуры
